<script lang="ts">
    import * as consts from "$lib/consts";
    import Frame from "$lib/components/Frame.svelte";
    import { Vote } from "$lib/types";

    const title = "Справка";
</script>

<Frame {title}>
    <div><a href="#about">О сайте</a></div>

    <div><a href="#termins">Термины</a></div>

    <div><a href="#colors">Цветовая маркировка мандел</a></div>

    <div><a href="#research">Исследования наших участников</a></div>

    <div>
        <a href="#rules">Рекомендуемые правила оформления мандел</a>
    </div>

    <div><a href="#trash">Манделы в хламе</a></div>

    <div><a href="#links">Полезные ссылки</a></div>

    <div>
        <a href="https://t.me/OceanMandela">
            Telegram канал с уведомлениями о новых манделах и комментариях
        </a>
    </div>

    <h2 id="about">О сайте</h2>
    <p>
        Здесь собираются факты об изменениях реальности по версии конспирологов
        или конфабуляции по версии учёных и скептиков.
    </p>
    <p>
        Сайт находится в активной разработке. Блог разработчика, чтобы узнать
        последние новости о том, как развивается сайт, или пожаловаться на
        проблемы, можно найти по адресу:
    </p>

    <a href="https://krre31.livejournal.com/tag/океан">
        https://krre31.livejournal.com/tag/океан
    </a>

    <h2 id="termins">Термины</h2>
    <ul>
        <li>
            мандела (женского рода) - конкретный факт об изменении реальности.
            Названа в честь Нельсона Манделы.
        </li>
        <li>
            геомандела - то же, что и мандела, только в более узком смысле,
            относящаяся к категории изменений географических карт или
            ландшафтов.
        </li>
        <li>
            личная мандела - та, которая приключались с вами, и поэтому о ней не
            прочитаешь в интернете. Например, изменилось что-то в одежде, в
            квартире или среди родственников.
        </li>
        <li>
            мандельщик - человек, подверженный действию эффекту Манделы, то есть
            тот, кто видит изменения, но при этом не считает, что это
            конфабуляции.
        </li>
        <li>
            остатки - материальные доказательства первоначального состояния
            факта до изменения, воспроизведённые человеком по памяти. Как
            правило, остатки делаются неосознанно, то есть или не зная, что факт
            уже изменился, или же создание остатка было выполнено ещё до
            изменения самого факта. Точный механизм возникновения остатков
            неизвестен.
        </li>
        <li>
            флип-флоп (англ. flip-flop; иногда называют "откат") - процесс, при
            котором изменение возвращается в первоначальное сотояние. То есть
            мандела исчезает, а большинство людей о ней забывают. Флип-флопы
            тоже иногда порождают свои остатки.
        </li>
        <li>
            манделиться - изменяться. При этом изменение оказывается в прошлом,
            словно оно всегда таким и было.
        </li>
    </ul>

    <h2 id="colors">Цветовая маркировка мандел</h2>

    Манделы на главной странице маркируются согласно результатам голосования
    следующими цветами в завимости от того, каких голосов больше:

    <ul>
        <li>
            {consts.Votes[Vote.Yes]} -
            <span style="background-color:{consts.VoteColors[Vote.Yes]}"
                >зелёный</span
            >
        </li>

        <li>
            {consts.Votes[Vote.No]} -
            <span style="background-color:{consts.VoteColors[Vote.No]}"
                >красный</span
            >
        </li>

        <li>
            {consts.Votes[Vote.Neutral]} -
            <span style="background-color:{consts.VoteColors[Vote.Neutral]}"
                >жёлтый</span
            >
        </li>

        <li>
            {consts.Votes[Vote.Fake]} -
            <span style="background-color:{consts.VoteColors[Vote.Fake]}"
                >серый</span
            >
        </li>
    </ul>

    <span
        >Если нет ни одного голоса, то <span
            style="background-color:{consts.VoteColors[Vote.Neutral]}"
        >
            жёлтый</span
        ></span
    >

    <h2 id="research">Исследования наших участников</h2>

    <ul>
        <li>
            <a href="https://mandelafx.livejournal.com/906.html">
                Категории мандельских аномалий
            </a>
            - попытка систематизации наблюдаемых аномалий, выполненная Владимиром
            Зарыповым.
        </li>
        <li>
            <a href="/download/Основы манделоведения (по Зарыпову).docx">
                Основы манделоведения
            </a>
            - учебное пособие, составленное Заинтересованным скептиком.
        </li>
    </ul>

    <h2 id="rules">Рекомендуемые правила оформления мандел</h2>

    <ol>
        <li>
            Есть два типа заголовка - простой и сложный.
            <ul>
                <li>
                    В простом заголовке нужно указать только тему манделы.
                    Напишите о новой версии описываемого вами факта с целью
                    привлечения внимания тех, кто увидит новую версию впервые.
                    <h4>Пример</h4>
                    <p>Мандела умер в 2013 году.</p>
                    <p>В моём доме не выражаться.</p>
                    <p>В Nutella нет полосок.</p>
                </li>
                <li>
                    В сложном заголовке присутствуют уже три поля: Что, Было,
                    Стало. Они больше подходят для мандел, в которых что-то
                    изменилось. В Что укажите, о чём идет речь. В Было - как вы
                    помните предыдущую версию факта. В Стало - как официально
                    есть сейчас.
                    <h4>Пример</h4>
                    <p>
                        Что: Прощальная речь Ельцина
                        <br />
                        Было: Я устал, я ухожу
                        <br />
                        Стало: Я ухожу
                    </p>
                    <p>В каталоге такой заголовок будет показан в виде:</p>
                    <p>Прощальная речь Ельцина: Я устал, я ухожу / Я ухожу</p>
                </li>
            </ul>
        </li>
        <li>
            В описании предоставьте дополнительную информацию о факте. Опишите
            как старую версию, так и новую.
        </li>
        <h4>Пример</h4>
        <p>
            Мандела умер в тюрьме в ЮАР в начале 90-х годов. Однако теперь он
            остался жив, вышел из тюрьмы, стал президентом ЮАР и умер в глубкой
            старости в 2013 году.
        </p>
        <li>
            Снабдите ваши пояснения изображениями. Можете показать факт в новом
            состоянии.
            <h4>Пример</h4>
            <p>Фото дожившего до седин Манделы.</p>
            А также остатки, подтверждающие, что ваша версия не выдумана.
            <h4>Пример</h4>
            <p>
                Скан старой газеты, где написано о смерти Манделы в 90-х годах.
                Либо воспоминания других людей, описывающих похороны и траур по
                Манделе на весь СССР.
            </p>
        </li>
        <li>
            Если манделу можно посмотреть на видео, то добавьте ролик с YouTube,
            демонстрирующий новую версию (старой на видео вы уже не найдёте).
            <h4>Пример</h4>
            <p>
                Речь Ельцина, где вместо "Я устал, я ухожу" он говорит "Я ухожу.
                Я сделал, всё что мог".
            </p>
        </li>
        <li>
            Если тема вашей манделы уже была где-то подробно описана, то укажите
            ссылку на это описание.
            <h4>Пример</h4>
            <p>
                <a href="https://krre31.livejournal.com/39995.html">
                    https://krre31.livejournal.com/39995.html
                </a>
            </p>
        </li>
        <li>
            Если вы нашли манделу в другом месте и точно знаете, что это место
            является первоисточником, и раньше о ней нигде не упоминалось, то
            также укажите ссылку на этот первоисточник, чтобы за вами потом не
            гонялись копирасты. Если мандела общеизвестная, то такую ссылку
            можно не указывать.
            <p></p>
        </li>
        <li>
            Все правила не являются обязательными. Если у вас творческий кризис,
            и вы не знаете, что писать о манделе, то и одного заголовка будет
            достаточно.
        </li>
    </ol>

    <h2 id="trash">Манделы в хламе</h2>

    Согласно официальной научной трактовке, эффект Манделы выражается в
    проявлении ложной КОЛЛЕКТИВНОЙ памяти. Это значит, что о каком-то факте
    должно одинаково неправильно помнить БОЛЬШОЕ количество людей. Если
    неправильно факт помнит один человек или несколько, то это либо их личная
    мандела, либо они эту манделу придумали сами из каких-то личных побуждений,
    зачастую конспирологических. Такие манделы мало кому интересны, их
    присутствие в Каталоге у многих вызывает раздражение, поэтому мы переносим
    их в раздел Хлам по следующим правилам:

    <ul>
        <li>
            Первые двое суток после добавления в Каталог мандела оценивается
            путём голосования.
        </li>
        <li>
            Если количество голосов "Да" меньше 4, мандела отправляется в Хлам.
        </li>
        <li>
            Если количество голосов "Ерунда" превышает количество голосов "Да",
            мандела отправляется в Хлам.
        </li>
        <li>
            Мандела может быть возвращена из Хлама, если перестают выполняться
            предыдущие два условия.
        </li>
    </ul>

    Сервер проверяет все манделы каждые 12 часов и автоматически переносит их в
    Хлам или возвращает обратно в Каталог на основании текущей статистики
    голосов.

    <h2 id="links">Полезные ссылки</h2>

    <h3>Энциклопедии</h3>
    <div>
        <a href="https://ru.wikipedia.org/wiki/Эффект_Манделы">
            Статья об ЭМ на Википедии
        </a>
    </div>

    <div>
        <a href="https://mrakopedia.net/wiki/Эффект_Манделы">
            Статья об ЭМ на Мракопедии
        </a>
    </div>
    <div>
        <a href="https://lurkmore.to/Эффект_Манделы">Статья об ЭМ на Лурке</a>
    </div>

    <h3>Социальные сети</h3>
    <div>
        <a href="https://vk.com/mandelaeffect">
            Группа Сергея Игнатенко в ВК об ЭМ (закрытая)
        </a>
    </div>

    <div>
        <a href="https://vk.com/effekt_mandely">Группа в ВК об ЭМ (открытая)</a>
    </div>

    <h3>Блоги</h3>
    <div>
        <a href="https://krre.blogspot.com">
            Старый блог Владимира Зарыпова об ЭМ на blogspot.com (с 2017 г. по
            2019 г.)
        </a>
    </div>

    <div>
        <a href="https://krre31.livejournal.com">
            Новый блог Владимира Зарыпова "Манделы... Они повсюду..." об ЭМ на
            livejournal.com (с 2019 г. по настоящее время)
        </a>
    </div>

    <div>
        <a href="https://lyces.livejournal.com">
            Блог Лукеса "Другой XXI век" для общения на тему ЭМ
        </a>
    </div>

    <div>
        <a href="https://wariwona.livejournal.com">
            Блог "Мои манделы" мандельщицы wariwona
        </a>
    </div>

    <div>
        <a href="https://serg378.livejournal.com">
            Блог мандельщика serg378 на тему мандельских теорий
        </a>
    </div>

    <div>
        <a href="https://janakaties.livejournal.com">
            Блог "В НИКУДА" мандельщицы janakaties
        </a>
    </div>

    <div>
        <a href="https://nekto-nikto-0.livejournal.com">
            Блог мандельщика nekto_nikto_0 о медицинских манделах
        </a>
    </div>

    <div>
        <a href="https://njkntr.livejournal.com">Блог мандельщицы njkntr</a>
    </div>

    <h3>YouTube</h3>
    <div>
        <a
            href="https://www.youtube.com/watch?v=oIPxMiv7UDM&list=PLzoF5ji3elGBAiBIhf1eHgAIgZJ6uiTMD"
        >
            Плейлист "Эффект манделы. Большая подборка" на канале
            "Перпендикулярный мир" Александра Бессонова
        </a>
    </div>

    <div>
        <a
            href="https://www.youtube.com/watch?v=fzK5JPzUtaA&list=PLA7jWfhdkQCdz6fgOZn8YAjqdUzqoO3CM"
        >
            Плейлист "Теории Заговора и Эффект Манделы" на канале "Gravity
            Tonya"
        </a>
    </div>

    <div>
        <a href="https://www.youtube.com/channel/UCz7OMKe4XKTvSqvCxQKhuvw">
            YouTube-канал "EYA" на тему ЭМ в Библии (англоязычный)
        </a>
    </div>

    <div>
        <a href="https://www.youtube.com/user/poijkluh">
            YouTube-канал "Curiouser& Curiouser" (англоязычный)
        </a>
    </div>

    <div>
        <a href="https://www.youtube.com/channel/UC5zTBzYzNlg7YsyQFZSrpyw">
            YouTube-канал "Once Upon a Timeline" (англоязычный)
        </a>
    </div>

    <h3>Reddit</h3>
    <div>
        <a href="https://www.reddit.com/r/MandelaEffect">
            MandelaEffect (англоязычный)
        </a>
    </div>

    <div>
        <a href="https://www.reddit.com/r/Retconned">Retconned (англоязычный)</a
        >
    </div>

    <h3>Каталоги мандел</h3>
    <div><a href="http://mandela-ru.wikidot.com">Манделопедия</a></div>

    <div>
        <a href="http://effectmandela.ru">
            ЭФФЕКТ МАНДЕЛЫ. Сайт об изменение реальности
        </a>
    </div>

    <h3>Фильмы</h3>
    <div>
        <a href="https://www.youtube.com/watch?v=_wXMbUC3zwE">
            АНТИМИР: изменение реальности. Фильм Галины Царёвой / 2018
            (документальный)
        </a>
    </div>

    <div>
        <a
            href="https://www.kinoasic.com/load/fantasticheskie/ehffekt_mandely_the_mandela_effect_2019_onlajn/20-1-0-2199"
        >
            Эффект Манделы / The Mandela Effect / 2019 (художественный)
        </a>
    </div>
</Frame>
